In [1]:
'''Slicing ke waqt jitne : honge utne dimension ka matrix return hoga numpy array me '''

'Slicing ke waqt jitne : honge utne dimension ka matrix return hoga numpy array me '

In [67]:
import pandas as pd
from pandas import Series, DataFrame
# pandas has two famous data structres which we would study extensively

# Data Structures of Python
It has 2 data structures one is SERIES and other is DATA FRAMES

In [68]:
s = pd.Series([11,22,33,44,55,66,77])
print(s)      # s is the series object/labels(These are default labels) and 1st column is index and other column is values

0    11
1    22
2    33
3    44
4    55
5    66
6    77
dtype: int64

# ACCESSING DATA FROM SERIES

In [69]:
print(s[5])    #Single value access
print(s[[4,0]])

66
4    55
0    11
dtype: int64

In [70]:
s[5] = 55555                  #updation
s[[3,2]] = [33333,222222]
print(s)

0        11
1        22
2    222222
3     33333
4        55
5     55555
6        77
dtype: int64

In [71]:
del s[4]

In [72]:
print(s)

0        11
1        22
2    222222
3     33333
5     55555
6        77
dtype: int64

In [73]:
s[7] = 777777       #Insertion

In [74]:
print(s)
s[9] = 9999
print(s)

0        11
1        22
2    222222
3     33333
5     55555
6        77
7    777777
dtype: int64
0        11
1        22
2    222222
3     33333
5     55555
6        77
7    777777
9      9999
dtype: int64

In [75]:
s[9] = 9999
print(s)

0        11
1        22
2    222222
3     33333
5     55555
6        77
7    777777
9      9999
dtype: int64

In [76]:
s[[7,9]] =[7,9]
print(s)

0        11
1        22
2    222222
3     33333
5     55555
6        77
7         7
9         9
dtype: int64

# WE CAN'T PERFORM MULTIPLE DELETE AND INSERTION

In [77]:
'''Sequence does not matter it does not have index , BUT LABELS IT IS THE KEY'''

'Sequence does not matter it does not have index , BUT LABELS IT IS THE KEY'

# Defining our own index (Labels/Keys)

In [78]:
s1 = pd.Series([100,200,300,400], index = ["apples", "Oranges", "Banana", "Kivis"])
print(s1)

apples     100
Oranges    200
Banana     300
Kivis      400
dtype: int64

In [79]:
'''Combining'''
ourIndex = ["Mangoes", "apples", "Oranges", "Banana", "Kivis", "Grapes"]
s2 = pd.Series(s1, index = ourIndex)
print(s2)            #Jo data usko nhi mila usko NaN kardega means ke wo cell khaali he and datatype would be float.

Mangoes      NaN
apples     100.0
Oranges    200.0
Banana     300.0
Kivis      400.0
Grapes       NaN
dtype: float64

In [80]:
print(s2 >0)

Mangoes    False
apples      True
Oranges     True
Banana      True
Kivis       True
Grapes     False
dtype: bool

In [81]:
print(s2[s2>100])

Oranges    200.0
Banana     300.0
Kivis      400.0
dtype: float64

In [82]:
print("Oranges" in s2)

True

In [83]:
print("Fruit" in s2)

False

# Creating a series using dictionaries

In [84]:
'''Web se jitna bhi data fetch hota he dictionary form me hota he'''
dictionary = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
s3 = pd.Series(dictionary)
print(s3)
print(s3.keys())    #returning Keys
print(s3.index)     #returning indexes
print(s3.values)    #returning values

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64
Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')
Index(['Ohio', 'Texas', 'Oregon', 'Utah'], dtype='object')
[35000 71000 16000  5000]

In [85]:
students = [{"Name":"Inam", "Age" : 42},{"Name":"Mohsin", "Age": 26}]

In [86]:
std = pd.DataFrame(students, index = ["1" , "2"])
print(std)

   Age    Name
1   42    Inam
2   26  Mohsin

In [87]:
student2 = {"Name":["Mohsin", "Inam"], "Age":[123, 321]}
std2 = pd.DataFrame(student2)
std2

     Name  Age
0  Mohsin  123
1    Inam  321

In [88]:
print(s2)
print(pd.notnull(s2))
print(pd.isnull(s2))

Mangoes      NaN
apples     100.0
Oranges    200.0
Banana     300.0
Kivis      400.0
Grapes       NaN
dtype: float64
Mangoes    False
apples      True
Oranges     True
Banana      True
Kivis       True
Grapes     False
dtype: bool
Mangoes     True
apples     False
Oranges    False
Banana     False
Kivis      False
Grapes      True
dtype: bool

# DATA FRAME IS TWO DIMENSIONAL

In [89]:
df = pd.DataFrame(["Red","Green","Blue"])
df

       0
0    Red
1  Green
2   Blue

In [90]:
df = pd.DataFrame(["Red","Green","Blue"], index = ["v1","v2","v3"] ,columns = ["c1"])
print(df)

       c1
v1    Red
v2  Green
v3   Blue

# Creating a Data frame using dictionary

In [91]:
scores =  {"Ai for EO" :[30,89,87,81,76,78,98,90,71,67],
        "Python1":      [67,87,56,40,81,90,98,45,98,67],
        "Python2" :     [78,89,76,78,56,49,89,71,70,45]
        }
data = pd.DataFrame(scores)
data

   Ai for EO  Python1  Python2
0         30       67       78
1         89       87       89
2         87       56       76
3         81       40       78
4         76       81       56
5         78       90       49
6         98       98       89
7         90       45       71
8         71       98       70
9         67       67       45

In [92]:
data = pd.DataFrame(scores, index = ["Ali", "Ahmed", "Nasir", "Asad", "Khan","Saad",
                                    "Fahad","Usman","Talha","Fazal"])
data

       Ai for EO  Python1  Python2
Ali           30       67       78
Ahmed         89       87       89
Nasir         87       56       76
Asad          81       40       78
Khan          76       81       56
Saad          78       90       49
Fahad         98       98       89
Usman         90       45       71
Talha         71       98       70
Fazal         67       67       45

In [93]:
'''I want to get only one column'''
print(data.Python1)

Ali      67
Ahmed    87
Nasir    56
Asad     40
Khan     81
Saad     90
Fahad    98
Usman    45
Talha    98
Fazal    67
Name: Python1, dtype: int64

In [94]:
print(data['Python1'])

Ali      67
Ahmed    87
Nasir    56
Asad     40
Khan     81
Saad     90
Fahad    98
Usman    45
Talha    98
Fazal    67
Name: Python1, dtype: int64

In [95]:
#print(data.AI for EO)       # there is a problem so if we have this type of column then we would add quotationn
print(data["Ai for EO"])

Ali      30
Ahmed    89
Nasir    87
Asad     81
Khan     76
Saad     78
Fahad    98
Usman    90
Talha    71
Fazal    67
Name: Ai for EO, dtype: int64

In [96]:
'''Now we are accessing Rows'''
data["Python1"]["Nasir"]

56

In [97]:
#data["Python1","Python2","Ai for EO"]["Nasir"]     #Error
#data[["Python1","Python2","Ai for EO"]["Nasir"]    #Error
#data.loc["Nasir"]["Python1","Python2","Ai for EO"]  #Error
data.loc["Nasir"]

Ai for EO    87
Python1      56
Python2      76
Name: Nasir, dtype: int64

In [98]:
print(data.loc["Nasir"]["Ai for EO":"Python2"])   #Last value is inclusive
print(data.iloc[2][0:3])                          #iloc for integer location
print(data.iloc[2]["Ai for EO":"Python2"])        #loc for location
print(data.iloc[2][["Ai for EO","Python2"]])      #There is a diffrence btw : and , . Here we are using fancy indexing

Ai for EO    87
Python1      56
Python2      76
Name: Nasir, dtype: int64
Ai for EO    87
Python1      56
Python2      76
Name: Nasir, dtype: int64
Ai for EO    87
Python1      56
Python2      76
Name: Nasir, dtype: int64
Ai for EO    87
Python2      76
Name: Nasir, dtype: int64

In [99]:
#data.loc["Ali":"Usman"]["Ai for EO":"Python2"]    #Error
data.loc["Ali":"Usman"]

       Ai for EO  Python1  Python2
Ali           30       67       78
Ahmed         89       87       89
Nasir         87       56       76
Asad          81       40       78
Khan          76       81       56
Saad          78       90       49
Fahad         98       98       89
Usman         90       45       71

In [100]:
data.loc["Ali":"Usman"]["Ai for EO"]

Ali      30
Ahmed    89
Nasir    87
Asad     81
Khan     76
Saad     78
Fahad    98
Usman    90
Name: Ai for EO, dtype: int64

In [101]:
data.loc["Ali":"Usman"][["Ai for EO","Python1"]]

       Ai for EO  Python1
Ali           30       67
Ahmed         89       87
Nasir         87       56
Asad          81       40
Khan          76       81
Saad          78       90
Fahad         98       98
Usman         90       45

In [102]:
data.iloc[0:6][["Ai for EO","Python1"]]    #Other end is exclusive

       Ai for EO  Python1
Ali           30       67
Ahmed         89       87
Nasir         87       56
Asad          81       40
Khan          76       81
Saad          78       90

In [103]:
'''Data Deletion'''
print(data)

       Ai for EO  Python1  Python2
Ali           30       67       78
Ahmed         89       87       89
Nasir         87       56       76
Asad          81       40       78
Khan          76       81       56
Saad          78       90       49
Fahad         98       98       89
Usman         90       45       71
Talha         71       98       70
Fazal         67       67       45

In [104]:
'''Adding of new column in data'''
data['Extra'] = 45
print(data)

       Ai for EO  Python1  Python2  Extra
Ali           30       67       78     45
Ahmed         89       87       89     45
Nasir         87       56       76     45
Asad          81       40       78     45
Khan          76       81       56     45
Saad          78       90       49     45
Fahad         98       98       89     45
Usman         90       45       71     45
Talha         71       98       70     45
Fazal         67       67       45     45

In [105]:
data['Extra'] = range(10)
print(data)

       Ai for EO  Python1  Python2  Extra
Ali           30       67       78      0
Ahmed         89       87       89      1
Nasir         87       56       76      2
Asad          81       40       78      3
Khan          76       81       56      4
Saad          78       90       49      5
Fahad         98       98       89      6
Usman         90       45       71      7
Talha         71       98       70      8
Fazal         67       67       45      9

In [106]:
data['extra'] = [23,34,54,65,76,87,56,5,4,34]
print(data)

       Ai for EO  Python1  Python2  Extra  extra
Ali           30       67       78      0     23
Ahmed         89       87       89      1     34
Nasir         87       56       76      2     54
Asad          81       40       78      3     65
Khan          76       81       56      4     76
Saad          78       90       49      5     87
Fahad         98       98       89      6     56
Usman         90       45       71      7      5
Talha         71       98       70      8      4
Fazal         67       67       45      9     34

In [107]:
'''Making od percentage'''
data["Total"] = (data["Ai for EO"]+ data["Python1"]+data["Python2"])/300 * 100

In [108]:
data

       Ai for EO  Python1  Python2  Extra  extra      Total
Ali           30       67       78      0     23  58.333333
Ahmed         89       87       89      1     34  88.333333
Nasir         87       56       76      2     54  73.000000
Asad          81       40       78      3     65  66.333333
Khan          76       81       56      4     76  71.000000
Saad          78       90       49      5     87  72.333333
Fahad         98       98       89      6     56  95.000000
Usman         90       45       71      7      5  68.666667
Talha         71       98       70      8      4  79.666667
Fazal         67       67       45      9     34  59.666667

In [109]:
del data['extra']

In [110]:
data.columns

Index(['Ai for EO', 'Python1', 'Python2', 'Extra', 'Total'], dtype='object')

In [111]:
data.keys

<bound method NDFrame.keys of        Ai for EO  Python1  Python2  Extra      Total
Ali           30       67       78      0  58.333333
Ahmed         89       87       89      1  88.333333
Nasir         87       56       76      2  73.000000
Asad          81       40       78      3  66.333333
Khan          76       81       56      4  71.000000
Saad          78       90       49      5  72.333333
Fahad         98       98       89      6  95.000000
Usman         90       45       71      7  68.666667
Talha         71       98       70      8  79.666667
Fazal         67       67       45      9  59.666667>

In [112]:
data.index

Index(['Ali', 'Ahmed', 'Nasir', 'Asad', 'Khan', 'Saad', 'Fahad', 'Usman',
       'Talha', 'Fazal'],
      dtype='object')

In [113]:
data.describe()

       Ai for EO    Python1    Python2     Extra      Total
count  10.000000  10.000000  10.000000  10.00000  10.000000
mean   76.700000  72.900000  70.100000   4.50000  73.233333
std    18.903556  21.168373  15.452076   3.02765  11.659839
min    30.000000  40.000000  45.000000   0.00000  58.333333
25%    72.250000  58.750000  59.500000   2.25000  66.916667
50%    79.500000  74.000000  73.500000   4.50000  71.666667
75%    88.500000  89.250000  78.000000   6.75000  78.000000
max    98.000000  98.000000  89.000000   9.00000  95.000000

In [114]:
data.head()    #It will show bydefault 5 values

       Ai for EO  Python1  Python2  Extra      Total
Ali           30       67       78      0  58.333333
Ahmed         89       87       89      1  88.333333
Nasir         87       56       76      2  73.000000
Asad          81       40       78      3  66.333333
Khan          76       81       56      4  71.000000

In [115]:
import numpy as np
data["result"] = data["Total"] >60
data["status"] = np.where(data["Total"] > 60 ,"pass","fail")
data

       Ai for EO  Python1  Python2  Extra      Total  result status
Ali           30       67       78      0  58.333333   False   fail
Ahmed         89       87       89      1  88.333333    True   pass
Nasir         87       56       76      2  73.000000    True   pass
Asad          81       40       78      3  66.333333    True   pass
Khan          76       81       56      4  71.000000    True   pass
Saad          78       90       49      5  72.333333    True   pass
Fahad         98       98       89      6  95.000000    True   pass
Usman         90       45       71      7  68.666667    True   pass
Talha         71       98       70      8  79.666667    True   pass
Fazal         67       67       45      9  59.666667   False   fail

In [116]:
data["result"] = ["pass" if i >60 else "Fail" for i in data["Total"]]
data

       Ai for EO  Python1  Python2  Extra      Total result status
Ali           30       67       78      0  58.333333   Fail   fail
Ahmed         89       87       89      1  88.333333   pass   pass
Nasir         87       56       76      2  73.000000   pass   pass
Asad          81       40       78      3  66.333333   pass   pass
Khan          76       81       56      4  71.000000   pass   pass
Saad          78       90       49      5  72.333333   pass   pass
Fahad         98       98       89      6  95.000000   pass   pass
Usman         90       45       71      7  68.666667   pass   pass
Talha         71       98       70      8  79.666667   pass   pass
Fazal         67       67       45      9  59.666667   Fail   fail

In [117]:
data["subjectWise"] = ["pass" if i > 50 else "fail" for i in data["Ai for EO" or "Python1" or "Python2"]]
data

       Ai for EO  Python1  Python2  Extra      Total result status subjectWise
Ali           30       67       78      0  58.333333   Fail   fail        fail
Ahmed         89       87       89      1  88.333333   pass   pass        pass
Nasir         87       56       76      2  73.000000   pass   pass        pass
Asad          81       40       78      3  66.333333   pass   pass        pass
Khan          76       81       56      4  71.000000   pass   pass        pass
Saad          78       90       49      5  72.333333   pass   pass        pass
Fahad         98       98       89      6  95.000000   pass   pass        pass
Usman         90       45       71      7  68.666667   pass   pass        pass
Talha         71       98       70      8  79.666667   pass   pass        pass
Fazal         67       67       45      9  59.666667   Fail   fail        pass